In [18]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(
        {"a" : [4, 5, 6],
         "b" : [7, 8, 9],
         "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
            [('d', 1), ('d', 2), ('e', 2)],
                names=['n', 'v']))

In [6]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [7]:
df["a"] != 7

n  v
d  1    True
   2    True
e  2    True
Name: a, dtype: bool

In [9]:
df[df["b"] != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [15]:
df.a.isin([5, 6])

n  v
d  1    False
   2     True
e  2     True
Name: a, dtype: bool

In [16]:
df['a'].isin([5, 6]) # 한글이 섞여있거나, 콜론을 사용해서 확인하고 싶을 때는 이렇게 사용하면 된다.

n  v
d  1    False
   2     True
e  2     True
Name: a, dtype: bool

In [17]:
pd.isnull(df) #null값에 True를 찍어준다.

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [19]:
df1 = pd.DataFrame(
        {"a" : [4, 5, 6, 6, np.nan],
         "b" : [7, 8, np.nan, 9, 9],
         "c" : [10, 11, 12, np.nan, 12]},
    index = pd.MultiIndex.from_tuples(
            [('d', 1), ('d', 2), ('e', 2), ('e', 3), ('e', 3)],
                names=['n', 'v']))

In [20]:
df1

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [21]:
pd.isnull(df1) #null값에 대해서 true를 표시해 준다.

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  3   True  False  False

In [22]:
df1['a'].isnull() # 특정 column의 null값을 확인할 수도 있다.

n  v
d  1    False
   2    False
e  2    False
   3    False
   3     True
Name: a, dtype: bool

In [23]:
df1['a'].isnull().sum() # null값이 몇 개가 있는지도 확인할 수 있다.

1

In [24]:
pd.notnull(df) #null값이 아닌 것을 찾을 수도 있다.

        a     b     c
n v
d 1  True  True  True
  2  True  True  True
e 2  True  True  True

In [26]:
df.notnull() # 똑같은 결과를 보여준다.

        a     b     c
n v
d 1  True  True  True
  2  True  True  True
e 2  True  True  True

In [27]:
df.notnull().sum() # not null의 개수를 보여준다.

a    3
b    3
c    3
dtype: int64

In [28]:
df.a.notnull().sum() a컬럼의 not null의 개수를 보여주기도 한다.

3

In [29]:
df.any()

a    True
b    True
c    True
dtype: bool

In [30]:
df.all()

a    True
b    True
c    True
dtype: bool

In [32]:
~df.a.notnull() #~ 표시를 해주면 not 표시가 된다. 그래서 결과가 정반대로 뒤바뀐다.

n  v
d  1    False
   2    False
e  2    False
Name: a, dtype: bool

In [33]:
1 and 2

2

In [35]:
True and False

False

In [45]:
False and False

False

In [46]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [51]:
df1

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [60]:
# 데이터 프레임에서는 and를 사용할 수 없다. 
# df[df.b == 7] and df[df.a == 5]
df1[(df1.b == 7) | (df1.a == 5)]

# 여러 개의 조건을 비교할 때는 (괄호)로 조건을 묶어서 사용한다.
# 괄호로 묶어서 사용해야지 &, | 연산과 연산자 우선순위로 연산 순위가 섞이는 오류를 방지할 수 있다.

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0